Autodesk.Revit.DB.Visual.AssetProperty.IsValidSchemaIdentifier(System.String)
Check that schema name is valid
schemaID:
The schema name.
Returns:
True if the schema name is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperty.AddCopyAsConnectedAsset(Autodesk.Revit.DB.Visual.Asset)
Makes a copy of the asset and connects it to this property.
pRenderingAsset:
The asset to duplicate and associate with this property as a connected asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
-or-
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
-or-
Asset property is already connected to one asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperty.AddConnectedAsset(System.String)
Adds a new connected asset attached to this asset property, if it allows it.
Remarks:
Cannot add a connected asset if one is already connected.
Use RemoveConnectedAsset() to avoid an exception being thrown.
A new preset asset is created and connected to the property.
For "UnifiedBitmap", it contains an empty property unifiedbitmap_Bitmap.
schema:
The schema name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The schema name is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
-or-
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
-or-
Asset property is already connected to one asset.
Since:
2018.1